; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	infrared1 - mode
	thermograph2 - mode
	image0 - mode
	image3 - mode
	spectrograph4 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph4)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 image3)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument3 thermograph2)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
)
(:goal (and
	(pointing satellite0 Star13)
	(pointing satellite1 Star13)
	(pointing satellite2 Star1)
	(have_image Star5 spectrograph4)
	(have_image Phenomenon6 infrared1)
	(have_image Star7 image0)
	(have_image Phenomenon8 image0)
	(have_image Star9 spectrograph4)
	(have_image Star10 image3)
	(have_image Phenomenon11 image3)
	(have_image Star12 image0)
	(have_image Star13 image3)
	(have_image Planet14 image3)
	(have_image Phenomenon15 infrared1)
))

)

; plan
1. (turn_to satellite2 groundstation2 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 14
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 14
3. (calibrate satellite2 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 14
4. (turn_to satellite2 phenomenon6 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon6)
   goals met: 0 of 14
5. (take_image satellite2 phenomenon6 instrument3 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 1 of 14
6. (turn_to satellite2 phenomenon15 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 14
7. (turn_to satellite1 star13 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 star13)
   goals met: 2 of 14
8. (turn_to satellite0 groundstation2 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 14
9. (take_image satellite2 phenomenon15 instrument3 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 3 of 14
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 14
11. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 3 of 14
12. (turn_to satellite0 phenomenon11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 14
13. (take_image satellite0 phenomenon11 instrument1 image3)
   added: (have_image phenomenon11 image3)
   goals met: 4 of 14
14. (turn_to satellite0 planet14 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet14)
   goals met: 4 of 14
15. (take_image satellite0 planet14 instrument1 image3)
   added: (have_image planet14 image3)
   goals met: 5 of 14
16. (turn_to satellite0 star10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star10)
   goals met: 5 of 14
17. (take_image satellite0 star10 instrument1 image3)
   added: (have_image star10 image3)
   goals met: 6 of 14
18. (turn_to satellite0 star5 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star5)
   goals met: 6 of 14
19. (take_image satellite0 star5 instrument1 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 7 of 14
20. (turn_to satellite0 star9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star9)
   goals met: 7 of 14
21. (take_image satellite0 star9 instrument1 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 8 of 14
22. (turn_to satellite0 star13 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star13)
   goals met: 9 of 14
23. (take_image satellite0 star13 instrument1 image3)
   added: (have_image star13 image3)
   goals met: 10 of 14
24. (turn_to satellite2 phenomenon8 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon8)
   goals met: 10 of 14
25. (take_image satellite2 phenomenon8 instrument3 image0)
   added: (have_image phenomenon8 image0)
   goals met: 11 of 14
26. (turn_to satellite2 star12 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star12)
   goals met: 11 of 14
27. (take_image satellite2 star12 instrument3 image0)
   added: (have_image star12 image0)
   goals met: 12 of 14
28. (turn_to satellite2 star7 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star7)
   goals met: 12 of 14
29. (take_image satellite2 star7 instrument3 image0)
   added: (have_image star7 image0)
   goals met: 13 of 14
30. (turn_to satellite2 star1 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star1)
   goals met: 14 of 14
